/*
 Navicat MySQL Data Transfer

 Source Server         : localhost
 Source Server Version : 50712
 Source Host           : localhost
 Source Database       : ppgo_job

 Target Server Version : 50712
 File Encoding         : utf-8

 Date: 06/30/2017 16:48:34 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `default`
-- ----------------------------
DROP TABLE IF EXISTS `default`;
CREATE TABLE `default` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_name` varchar(20) NOT NULL DEFAULT '' COMMENT '用户名',
  `email` varchar(50) NOT NULL DEFAULT '' COMMENT '邮箱',
  `password` char(32) NOT NULL DEFAULT '' COMMENT '密码',
  `salt` char(10) NOT NULL DEFAULT '' COMMENT '密码盐',
  `last_login` int(11) NOT NULL DEFAULT '0' COMMENT '最后登录时间',
  `last_ip` char(15) NOT NULL DEFAULT '' COMMENT '最后登录IP',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，0正常 -1禁用',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_user_name` (`user_name`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `default`
-- ----------------------------
BEGIN;
INSERT INTO `default` VALUES ('1', 'admin', 'admin@example.com', '7fef6171469e80d32c0559f88b377245', '', '0', '', '0');
COMMIT;

-- ----------------------------
--  Table structure for `pp_task`
-- ----------------------------
DROP TABLE IF EXISTS `pp_task`;
CREATE TABLE `pp_task` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `group_id` int(11) NOT NULL DEFAULT '0' COMMENT '分组ID',
  `task_name` varchar(50) NOT NULL DEFAULT '' COMMENT '任务名称',
  `task_tag` varchar(200) NOT NULL COMMENT '任务标志，用于查找进程',
  `task_type` tinyint(4) unsigned NOT NULL DEFAULT '0' COMMENT '任务类型:1-常驻类型，0-定时类型',
  `description` varchar(200) NOT NULL DEFAULT '' COMMENT '任务描述',
  `cron_spec` varchar(100) NOT NULL DEFAULT '' COMMENT '时间表达式',
  `concurrent` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否只允许一个实例',
  `command` text NOT NULL COMMENT '命令详情',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0停用 1启用',
  `notify` tinyint(4) NOT NULL DEFAULT '0' COMMENT '通知设置',
  `notify_email` text NOT NULL COMMENT '通知人列表',
  `timeout` smallint(6) NOT NULL DEFAULT '0' COMMENT '超时设置',
  `execute_times` int(11) NOT NULL DEFAULT '0' COMMENT '累计执行次数',
  `prev_time` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '上次执行时间',
  `create_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `idx_user_id` (`user_id`),
  KEY `idx_group_id` (`group_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `pp_task`
-- ----------------------------
BEGIN;
INSERT INTO `pp_task` VALUES ('1', '1', '1', '测试任务', '', '0', '测试任务说明', '0 0/1 11 * *', '0', 'echo \"hello\\n\" >> /tmp/test_cron1.log', '0', '0', '', '0', '46', '1498187640', '1497855526'), ('2', '1', '1', '测试任务23', '', '0', '这是测试任务3', '*/5 * * * *', '0', 'echo \"hello22\" >> /tmp/test.log', '0', '1', 'sdf@11.com', '2', '14', '1498554870', '1498034382'), ('3', '1', '2', '测试php', 'test_cron', '1', '五秒中一次', '*/5  *  *  * *', '0', '/usr/local/php/bin/php /Users/haodaquan/Sites/WorkList/xiyou_channel/index.php /tmall_abroad/task test_cron', '0', '0', '', '0', '143', '1498808295', '1498541334'), ('4', '1', '1', '定时获取订单2', 'php-ce11', '1', '每五秒执行一次22', '*/5 * * * *', '0', 'echo \"test\" >> /tmp/test.log', '0', '0', '', '0', '15', '1498728615', '1498723369');
COMMIT;

-- ----------------------------
--  Table structure for `pp_task_group`
-- ----------------------------
DROP TABLE IF EXISTS `pp_task_group`;
CREATE TABLE `pp_task_group` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL DEFAULT '0' COMMENT '用户ID',
  `group_name` varchar(50) NOT NULL DEFAULT '' COMMENT '组名',
  `description` varchar(255) NOT NULL DEFAULT '' COMMENT '说明',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `idx_user_id` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `pp_task_group`
-- ----------------------------
BEGIN;
INSERT INTO `pp_task_group` VALUES ('1', '1', '测试分组的', '这是测试的分组内容', '0'), ('2', '1', '小红书', '小红书的任务', '0');
COMMIT;

-- ----------------------------
--  Table structure for `pp_task_log`
-- ----------------------------
DROP TABLE IF EXISTS `pp_task_log`;
CREATE TABLE `pp_task_log` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `task_id` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '任务ID',
  `output` mediumtext NOT NULL COMMENT '任务输出',
  `error` text NOT NULL COMMENT '错误信息',
  `status` tinyint(4) NOT NULL COMMENT '状态',
  `process_time` int(11) NOT NULL DEFAULT '0' COMMENT '消耗时间/毫秒',
  `create_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `idx_task_id` (`task_id`,`create_time`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `pp_task_log`
-- ----------------------------
BEGIN;
INSERT INTO `pp_task_log` VALUES ('1', '3', '2017-06-30 10:45:31开始写入日志\n2017-06-30 10:45:32开始写入日志\n2017-06-30 10:45:33开始写入日志\n2017-06-30 10:45:34开始写入日志\n2017-06-30 10:45:35开始写入日志\n2017-06-30 10:45:36开始写入日志\n2017-06-30 10:45:37开始写入日志\n2017-06-30 10:45:38开始写入日志\n2017-06-30 10:45:39开始写入日志\n2017-06-30 10:45:40开始写入日志\n2017-06-30 10:45:41开始写入日志\n2017-06-30 10:45:42开始写入日志\n2017-06-30 10:45:43开始写入日志\n2017-06-30 10:45:44开始写入日志\n2017-06-30 10:45:45开始写入日志\n2017-06-30 10:45:46开始写入日志\n2017-06-30 10:45:47开始写入日志\n2017-06-30 10:45:48开始写入日志\n2017-06-30 10:45:49开始写入日志\n2017-06-30 10:45:50开始写入日志\n2017-06-30 10:45:51开始写入日志\n2017-06-30 10:45:52开始写入日志\n2017-06-30 10:45:53开始写入日志\n2017-06-30 10:45:54开始写入日志\n2017-06-30 10:45:55开始写入日志\n2017-06-30 10:45:56开始写入日志\n2017-06-30 10:45:57开始写入日志\n2017-06-30 10:45:58开始写入日志\n2017-06-30 10:45:59开始写入日志\n2017-06-30 10:46:00开始写入日志\n2017-06-30 10:46:01开始写入日志\n2017-06-30 10:46:02开始写入日志\n2017-06-30 10:46:03开始写入日志\n2017-06-30 10:46:04开始写入日志\n2017-06-30 10:46:05开始写入日志\n2017-06-30 10:46:06开始写入日志\n2017-06-30 10:46:07开始写入日志\n2017-06-30 10:46:08开始写入日志\n2017-06-30 10:46:09开始写入日志\n2017-06-30 10:46:10开始写入日志\n2017-06-30 10:46:11开始写入日志\n2017-06-30 10:46:12开始写入日志\n2017-06-30 10:46:13开始写入日志\n2017-06-30 10:46:14开始写入日志\n2017-06-30 10:46:15开始写入日志\n2017-06-30 10:46:16开始写入日志\n2017-06-30 10:46:17开始写入日志\n2017-06-30 10:46:18开始写入日志\n2017-06-30 10:46:19开始写入日志\n2017-06-30 10:46:20开始写入日志\n2017-06-30 10:46:21开始写入日志\n2017-06-30 10:46:22开始写入日志\n2017-06-30 10:46:23开始写入日志\n2017-06-30 10:46:24开始写入日志\n2017-06-30 10:46:25开始写入日志\n2017-06-30 10:46:26开始写入日志\n2017-06-30 10:46:27开始写入日志\n2017-06-30 10:46:28开始写入日志\n2017-06-30 10:46:29开始写入日志\n2017-06-30 10:46:30开始写入日志\n2017-06-30 10:46:31开始写入日志\n2017-06-30 10:46:32开始写入日志\n2017-06-30 10:46:33开始写入日志\n2017-06-30 10:46:34开始写入日志\n2017-06-30 10:46:35开始写入日志\n2017-06-30 10:46:36开始写入日志\n2017-06-30 10:46:37开始写入日志\n2017-06-30 10:46:38开始写入日志\n2017-06-30 10:46:39开始写入日志\n2017-06-30 10:46:40开始写入日志\n2017-06-30 10:46:41开始写入日志\n2017-06-30 10:46:42开始写入日志\n2017-06-30 10:46:43开始写入日志\n2017-06-30 10:46:44开始写入日志\n2017-06-30 10:46:45开始写入日志\n2017-06-30 10:46:46开始写入日志\n2017-06-30 10:46:47开始写入日志\n2017-06-30 10:46:48开始写入日志\n2017-06-30 10:46:49开始写入日志\n2017-06-30 10:46:50开始写入日志\n2017-06-30 10:46:51开始写入日志\n2017-06-30 10:46:52开始写入日志\n2017-06-30 10:46:53开始写入日志\n2017-06-30 10:46:54开始写入日志\n2017-06-30 10:46:55开始写入日志\n2017-06-30 10:46:56开始写入日志\n2017-06-30 10:46:57开始写入日志\n2017-06-30 10:46:58开始写入日志\n2017-06-30 10:46:59开始写入日志\n2017-06-30 10:47:00开始写入日志\n2017-06-30 10:47:01开始写入日志\n2017-06-30 10:47:02开始写入日志\n2017-06-30 10:47:03开始写入日志\n2017-06-30 10:47:04开始写入日志\n2017-06-30 10:47:05开始写入日志\n2017-06-30 10:47:06开始写入日志\n2017-06-30 10:47:07开始写入日志\n2017-06-30 10:47:08开始写入日志\n2017-06-30 10:47:09开始写入日志\n2017-06-30 10:47:10开始写入日志\n2017-06-30 10:47:11开始写入日志\n2017-06-30 10:47:12开始写入日志\n2017-06-30 10:47:13开始写入日志\n2017-06-30 10:47:14开始写入日志\n2017-06-30 10:47:15开始写入日志\n2017-06-30 10:47:16开始写入日志\n2017-06-30 10:47:17开始写入日志\n2017-06-30 10:47:18开始写入日志\n2017-06-30 10:47:19开始写入日志\n2017-06-30 10:47:20开始写入日志\n2017-06-30 10:47:21开始写入日志\n2017-06-30 10:47:22开始写入日志\n2017-06-30 10:47:23开始写入日志\n2017-06-30 10:47:24开始写入日志\n2017-06-30 10:47:25开始写入日志\n2017-06-30 10:47:26开始写入日志\n2017-06-30 10:47:27开始写入日志\n2017-06-30 10:47:28开始写入日志\n2017-06-30 10:47:29开始写入日志\n2017-06-30 10:47:30开始写入日志\n2017-06-30 10:47:31开始写入日志\n2017-06-30 10:47:32开始写入日志\n2017-06-30 10:47:33开始写入日志\n2017-06-30 10:47:34开始写入日志\n2017-06-30 10:47:35开始写入日志\n2017-06-30 10:47:36开始写入日志\n2017-06-30 10:47:37开始写入日志\n2017-06-30 10:47:38开始写入日志\n2017-06-30 10:47:39开始写入日志\n2017-06-30 10:47:40开始写入日志\n2017-06-30 10:47:41开始写入日志\n2017-06-30 10:47:42开始写入日志\n2017-06-30 10:47:43开始写入日志\n2017-06-30 10:47:44开始写入日志\n2017-06-30 10:47:45开始写入日志\n2017-06-30 10:47:46开始写入日志\n2017-06-30 10:47:47开始写入日志\n2017-06-30 10:47:48开始写入日志\n2017-06-30 10:47:49开始写入日志\n2017-06-30 10:47:50开始写入日志\n2017-06-30 10:47:51开始写入日志\n2017-06-30 10:47:52开始写入日志\n2017-06-30 10:47:53开始写入日志\n2017-06-30 10:47:54开始写入日志\n2017-06-30 10:47:55开始写入日志\n2017-06-30 10:47:56开始写入日志\n2017-06-30 10:47:57开始写入日志\n2017-06-30 10:47:58开始写入日志\n2017-06-30 10:47:59开始写入日志\n2017-06-30 10:48:00开始写入日志\n2017-06-30 10:48:01开始写入日志\n2017-06-30 10:48:02开始写入日志\n2017-06-30 10:48:03开始写入日志\n2017-06-30 10:48:04开始写入日志\n2017-06-30 10:48:05开始写入日志\n2017-06-30 10:48:06开始写入日志\n2017-06-30 10:48:07开始写入日志\n2017-06-30 10:48:08开始写入日志\n2017-06-30 10:48:09开始写入日志\n2017-06-30 10:48:10开始写入日志\n2017-06-30 10:48:11开始写入日志\n2017-06-30 10:48:12开始写入日志\n2017-06-30 10:48:13开始写入日志\n2017-06-30 10:48:14开始写入日志\n2017-06-30 10:48:15开始写入日志\n2017-06-30 10:48:16开始写入日志\n2017-06-30 10:48:17开始写入日志\n2017-06-30 10:48:18开始写入日志\n2017-06-30 10:48:19开始写入日志\n2017-06-30 10:48:20开始写入日志\n2017-06-30 10:48:21开始写入日志\n2017-06-30 10:48:22开始写入日志\n2017-06-30 10:48:23开始写入日志\n2017-06-30 10:48:24开始写入日志\n2017-06-30 10:48:25开始写入日志\n2017-06-30 10:48:26开始写入日志\n2017-06-30 10:48:27开始写入日志\n2017-06-30 10:48:28开始写入日志\n2017-06-30 10:48:29开始写入日志\n2017-06-30 10:48:30开始写入日志\n2017-06-30 10:48:31开始写入日志\n2017-06-30 10:48:32开始写入日志\n2017-06-30 10:48:33开始写入日志\n2017-06-30 10:48:34开始写入日志\n2017-06-30 10:48:35开始写入日志\n2017-06-30 10:48:36开始写入日志\n2017-06-30 10:48:37开始写入日志\n2017-06-30 10:48:38开始写入日志\n2017-06-30 10:48:39开始写入日志\n2017-06-30 10:48:40开始写入日志\n2017-06-30 10:48:41开始写入日志\n2017-06-30 10:48:42开始写入日志\n2017-06-30 10:48:43开始写入日志\n2017-06-30 10:48:44开始写入日志\n2017-06-30 10:48:45开始写入日志\n2017-06-30 10:48:46开始写入日志\n2017-06-30 10:48:47开始写入日志\n2017-06-30 10:48:48开始写入日志\n2017-06-30 10:48:49开始写入日志\n2017-06-30 10:48:50开始写入日志\n2017-06-30 10:48:51开始写入日志\n2017-06-30 10:48:52开始写入日志\n2017-06-30 10:48:53开始写入日志\n2017-06-30 10:48:54开始写入日志\n2017-06-30 10:48:55开始写入日志\n2017-06-30 10:48:56开始写入日志\n2017-06-30 10:48:57开始写入日志\n2017-06-30 10:48:58开始写入日志\n2017-06-30 10:48:59开始写入日志\n2017-06-30 10:49:00开始写入日志\n2017-06-30 10:49:01开始写入日志\n2017-06-30 10:49:02开始写入日志\n2017-06-30 10:49:03开始写入日志\n2017-06-30 10:49:04开始写入日志\n2017-06-30 10:49:05开始写入日志\n2017-06-30 10:49:06开始写入日志\n2017-06-30 10:49:07开始写入日志\n2017-06-30 10:49:08开始写入日志\n2017-06-30 10:49:09开始写入日志\n2017-06-30 10:49:10开始写入日志\n2017-06-30 10:49:11开始写入日志\n2017-06-30 10:49:12开始写入日志\n2017-06-30 10:49:13开始写入日志\n2017-06-30 10:49:14开始写入日志\n2017-06-30 10:49:15开始写入日志\n2017-06-30 10:49:16开始写入日志\n2017-06-30 10:49:17开始写入日志\n2017-06-30 10:49:18开始写入日志\n2017-06-30 10:49:19开始写入日志\n2017-06-30 10:49:20开始写入日志\n2017-06-30 10:49:21开始写入日志\n2017-06-30 10:49:22开始写入日志\n2017-06-30 10:49:23开始写入日志\n2017-06-30 10:49:24开始写入日志\n2017-06-30 10:49:25开始写入日志\n2017-06-30 10:49:26开始写入日志\n2017-06-30 10:49:27开始写入日志\n2017-06-30 10:49:28开始写入日志\n2017-06-30 10:49:29开始写入日志\n2017-06-30 10:49:30开始写入日志\n2017-06-30 10:49:31开始写入日志\n2017-06-30 10:49:32开始写入日志\n2017-06-30 10:49:33开始写入日志\n2017-06-30 10:49:34开始写入日志\n2017-06-30 10:49:35开始写入日志\n2017-06-30 10:49:36开始写入日志\n2017-06-30 10:49:37开始写入日志\n2017-06-30 10:49:38开始写入日志\n2017-06-30 10:49:39开始写入日志\n', 'signal: killed:', '-1', '250268', '1498790730'), ('2', '3', '2017-06-30 11:00:21开始写入日志\n2017-06-30 11:00:22开始写入日志\n2017-06-30 11:00:23开始写入日志\n2017-06-30 11:00:24开始写入日志\n2017-06-30 11:00:25开始写入日志\n2017-06-30 11:00:26开始写入日志\n2017-06-30 11:00:27开始写入日志\n2017-06-30 11:00:28开始写入日志\n2017-06-30 11:00:29开始写入日志\n2017-06-30 11:00:30开始写入日志\n', 'signal: killed:', '-1', '10292', '1498791620'), ('3', '3', '2017-06-30 11:21:56开始写入日志\n2017-06-30 11:21:57开始写入日志\n2017-06-30 11:21:58开始写入日志\n2017-06-30 11:21:59开始写入日志\n2017-06-30 11:22:00开始写入日志\n2017-06-30 11:22:01开始写入日志\n2017-06-30 11:22:02开始写入日志\n2017-06-30 11:22:03开始写入日志\n2017-06-30 11:22:04开始写入日志\n2017-06-30 11:22:05开始写入日志\n2017-06-30 11:22:06开始写入日志\n2017-06-30 11:22:07开始写入日志\n', 'signal: killed:', '-1', '12625', '1498792915'), ('4', '3', '2017-06-30 11:28:51开始写入日志\n2017-06-30 11:28:52开始写入日志\n', 'signal: killed:', '-1', '3123', '1498793330'), ('5', '3', '2017-06-30 12:05:01开始写入日志\n2017-06-30 12:05:02开始写入日志\n2017-06-30 12:05:03开始写入日志\n2017-06-30 12:05:04开始写入日志\n2017-06-30 12:05:05开始写入日志\n', 'signal: killed:', '-1', '6057', '1498795500'), ('6', '3', '2017-06-30 12:06:31开始写入日志\n2017-06-30 12:06:32开始写入日志\n2017-06-30 12:06:33开始写入日志\n2017-06-30 12:06:34开始写入日志\n2017-06-30 12:06:35开始写入日志\n2017-06-30 12:06:36开始写入日志\n2017-06-30 12:06:37开始写入日志\n2017-06-30 12:06:38开始写入日志\n2017-06-30 12:06:39开始写入日志\n', 'signal: killed:', '-1', '9896', '1498795590'), ('7', '3', '2017-06-30 12:17:21开始写入日志\n2017-06-30 12:17:22开始写入日志\n2017-06-30 12:17:23开始写入日志\n2017-06-30 12:17:24开始写入日志\n2017-06-30 12:17:25开始写入日志\n2017-06-30 12:17:26开始写入日志\n2017-06-30 12:17:27开始写入日志\n2017-06-30 12:17:28开始写入日志\n', 'signal: killed:', '-1', '8298', '1498796240'), ('8', '3', '2017-06-30 12:20:01开始写入日志\n2017-06-30 12:20:02开始写入日志\n2017-06-30 12:20:03开始写入日志\n2017-06-30 12:20:04开始写入日志\n2017-06-30 12:20:05开始写入日志\n2017-06-30 12:20:06开始写入日志\n2017-06-30 12:20:07开始写入日志\n2017-06-30 12:20:08开始写入日志\n2017-06-30 12:20:09开始写入日志\n2017-06-30 12:20:10开始写入日志\n', 'signal: killed:', '-1', '10617', '1498796400'), ('9', '3', '2017-06-30 12:56:16开始写入日志\n2017-06-30 12:56:17开始写入日志\n2017-06-30 12:56:18开始写入日志\n2017-06-30 12:56:19开始写入日志\n2017-06-30 12:56:20开始写入日志\n2017-06-30 12:56:21开始写入日志\n2017-06-30 12:56:22开始写入日志\n2017-06-30 12:56:23开始写入日志\n2017-06-30 12:56:24开始写入日志\n2017-06-30 12:56:25开始写入日志\n2017-06-30 12:56:26开始写入日志\n', 'signal: killed:', '-1', '11809', '1498798575'), ('10', '3', '2017-06-30 13:24:41开始写入日志\n2017-06-30 13:24:42开始写入日志\n2017-06-30 13:24:43开始写入日志\n2017-06-30 13:24:44开始写入日志\n2017-06-30 13:24:45开始写入日志\n2017-06-30 13:24:46开始写入日志\n2017-06-30 13:24:47开始写入日志\n2017-06-30 13:24:48开始写入日志\n2017-06-30 13:24:49开始写入日志\n2017-06-30 13:24:50开始写入日志\n2017-06-30 13:24:51开始写入日志\n2017-06-30 13:24:52开始写入日志\n2017-06-30 13:24:53开始写入日志\n2017-06-30 13:24:54开始写入日志\n2017-06-30 13:24:55开始写入日志\n2017-06-30 13:24:56开始写入日志\n2017-06-30 13:24:57开始写入日志\n2017-06-30 13:24:58开始写入日志\n2017-06-30 13:24:59开始写入日志\n2017-06-30 13:25:00开始写入日志\n2017-06-30 13:25:01开始写入日志\n2017-06-30 13:25:02开始写入日志\n2017-06-30 13:25:03开始写入日志\n2017-06-30 13:25:04开始写入日志\n2017-06-30 13:25:05开始写入日志\n2017-06-30 13:25:06开始写入日志\n', 'signal: killed:', '-1', '27203', '1498800280'), ('11', '3', '2017-06-30 13:56:41开始写入日志\n2017-06-30 13:56:42开始写入日志\n2017-06-30 13:56:43开始写入日志\n2017-06-30 13:56:44开始写入日志\n2017-06-30 13:56:45开始写入日志\n2017-06-30 13:56:46开始写入日志\n2017-06-30 13:56:47开始写入日志\n2017-06-30 13:56:48开始写入日志\n2017-06-30 13:56:49开始写入日志\n2017-06-30 13:56:50开始写入日志\n2017-06-30 13:56:51开始写入日志\n2017-06-30 13:56:52开始写入日志\n2017-06-30 13:56:53开始写入日志\n2017-06-30 13:56:54开始写入日志\n', 'signal: killed:', '-1', '14527', '1498802200'), ('12', '3', '2017-06-30 13:59:56开始写入日志\n2017-06-30 13:59:57开始写入日志\n2017-06-30 13:59:58开始写入日志\n2017-06-30 13:59:59开始写入日志\n2017-06-30 14:00:00开始写入日志\n2017-06-30 14:00:01开始写入日志\n2017-06-30 14:00:02开始写入日志\n2017-06-30 14:00:03开始写入日志\n', 'signal: killed:', '-1', '8550', '1498802395'), ('13', '3', '2017-06-30 14:02:41开始写入日志\n2017-06-30 14:02:42开始写入日志\n2017-06-30 14:02:43开始写入日志\n2017-06-30 14:02:44开始写入日志\n2017-06-30 14:02:45开始写入日志\n2017-06-30 14:02:46开始写入日志\n2017-06-30 14:02:47开始写入日志\nsignal: killed', '', '0', '7457', '1498802560'), ('14', '3', '2017-06-30 14:04:28开始写入日志\n2017-06-30 14:04:29开始写入日志\n2017-06-30 14:04:30开始写入日志\n2017-06-30 14:04:31开始写入日志\n2017-06-30 14:04:32开始写入日志\n2017-06-30 14:04:33开始写入日志\n2017-06-30 14:04:34开始写入日志\n2017-06-30 14:04:35开始写入日志\n2017-06-30 14:04:36开始写入日志\n2017-06-30 14:04:37开始写入日志\n2017-06-30 14:04:38开始写入日志\n2017-06-30 14:04:39开始写入日志\n2017-06-30 14:04:40开始写入日志\n2017-06-30 14:04:41开始写入日志\n2017-06-30 14:04:42开始写入日志\n2017-06-30 14:04:43开始写入日志\n2017-06-30 14:04:44开始写入日志\n2017-06-30 14:04:45开始写入日志\n2017-06-30 14:04:46开始写入日志\n2017-06-30 14:04:47开始写入日志\n2017-06-30 14:04:48开始写入日志\n2017-06-30 14:04:49开始写入日志\n2017-06-30 14:04:50开始写入日志\n2017-06-30 14:04:51开始写入日志\n2017-06-30 14:04:52开始写入日志\n2017-06-30 14:04:53开始写入日志\n2017-06-30 14:04:54开始写入日志\n2017-06-30 14:04:55开始写入日志\n2017-06-30 14:04:56开始写入日志\n2017-06-30 14:04:57开始写入日志\n2017-06-30 14:04:58开始写入日志\n2017-06-30 14:04:59开始写入日志\nsignal: killed', '', '0', '32806', '1498802667'), ('15', '3', '2017-06-30 15:20:26开始写入日志\n2017-06-30 15:20:27开始写入日志\n2017-06-30 15:20:28开始写入日志\n2017-06-30 15:20:29开始写入日志\n2017-06-30 15:20:30开始写入日志\n2017-06-30 15:20:31开始写入日志\n2017-06-30 15:20:32开始写入日志\n2017-06-30 15:20:33开始写入日志\n2017-06-30 15:20:34开始写入日志\n2017-06-30 15:20:35开始写入日志\n2017-06-30 15:20:36开始写入日志\n2017-06-30 15:20:37开始写入日志\n2017-06-30 15:20:38开始写入日志\n2017-06-30 15:20:39开始写入日志\n2017-06-30 15:20:40开始写入日志\n2017-06-30 15:20:41开始写入日志\n2017-06-30 15:20:42开始写入日志\n2017-06-30 15:20:43开始写入日志\n2017-06-30 15:20:44开始写入日志\n2017-06-30 15:20:45开始写入日志\n2017-06-30 15:20:46开始写入日志\n2017-06-30 15:20:47开始写入日志\n2017-06-30 15:20:48开始写入日志\n2017-06-30 15:20:49开始写入日志\n2017-06-30 15:20:50开始写入日志\n2017-06-30 15:20:51开始写入日志\n2017-06-30 15:20:52开始写入日志\n2017-06-30 15:20:53开始写入日志\n2017-06-30 15:20:54开始写入日志\n2017-06-30 15:20:55开始写入日志\nsignal: killed', '', '0', '31220', '1498807225'), ('16', '3', '2017-06-30 15:20:56开始写入日志\nsignal: killed', '', '0', '1228', '1498807255'), ('17', '3', '2017-06-30 15:38:16开始写入日志\n2017-06-30 15:38:17开始写入日志\n2017-06-30 15:38:18开始写入日志\n2017-06-30 15:38:19开始写入日志\n2017-06-30 15:38:20开始写入日志\n2017-06-30 15:38:21开始写入日志\n2017-06-30 15:38:22开始写入日志\n2017-06-30 15:38:23开始写入日志\n2017-06-30 15:38:24开始写入日志\n2017-06-30 15:38:25开始写入日志\n2017-06-30 15:38:26开始写入日志\nsignal: killed', '', '0', '12042', '1498808295');
COMMIT;

-- ----------------------------
--  Table structure for `pp_user`
-- ----------------------------
DROP TABLE IF EXISTS `pp_user`;
CREATE TABLE `pp_user` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_name` varchar(20) NOT NULL DEFAULT '' COMMENT '用户名',
  `email` varchar(50) NOT NULL DEFAULT '' COMMENT '邮箱',
  `password` char(32) NOT NULL DEFAULT '' COMMENT '密码',
  `salt` char(10) NOT NULL DEFAULT '' COMMENT '密码盐',
  `last_login` int(11) NOT NULL DEFAULT '0' COMMENT '最后登录时间',
  `last_ip` char(15) NOT NULL DEFAULT '' COMMENT '最后登录IP',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，0正常 -1禁用',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_user_name` (`user_name`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `pp_user`
-- ----------------------------
BEGIN;
INSERT INTO `pp_user` VALUES ('1', 'admin', 'haodaquan@shoplinq.cn', '7fef6171469e80d32c0559f88b377245', '', '1498491432', '[', '0');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
